[
    {
        "text": "OpenAI just released ChatGPT Agent Mode.\n\nI tried it and I'm BLOWN away!🤯\n\nPeople have been using deep research but without the computer use.\n\nOthers have been asking OpenAI Operator to do tasks but that requires very specific instructions.\n\nThat's where ChatGPT Agent comes in. It's the best of both worlds. You get the computer use capability of Operator and also the in-depth analysis of Deep Research built into one.\n\nSo it can write code, use the terminal, create presentations, spreadsheets, images, research through dozens of websites and you can even interrupt it to add new instructions.\n\nHere's some tasks I asked it to execute:\n\n1. Stock Finder + Analysis + Presentation\nIt picked stocks using a criteria I provided, researched more about the pros and cons of each company and presented it to me in a ppt which I can show to anyone.\n\n2. In-Depth Trip Planning\nI asked it to plan everything for a company off-site and do it under a mentioned budget. It went through 10s of websites and came up with the best options and costs for travel, stay, eating, activities, etc.\n\n3. Shopping on Quick Commerce\nI asked it to use blinkit to order the ingredients for cooking paneer butter masala at home. It used Deep Research to figure out the ingredients, added them to the cart, and proceeded to checkout before handing it off to me for payment.\n\n4. Hiring for MarkitUp\nI asked it to log-in and use my LinkedIn account to search for YouTube Managers that I can hire at my company in Bengaluru full time. It took 30 minutes but gave me a spreadsheet with 10–15 potential candidates who want to switch, get hired and live in blr or are open to relocate and have significant YouTube experience.\n\nWe're just scratching the surface.\n\n- It can go through your unread emails overnight and collate the ones which are important for you to reply.\n- It can go through your calendar and get you ready for your daily meetings in advance.\n- Research competitors and do SWOT analysis.\n\nand much more!\n+ All these tasks can continue running in the background at the same time.\n\nWith tools like ChatGPT Agent, there's soo much that you can achieve as a single person. The future truly belongs to the one person businesses.\n\nWhat do you think?\n\nHave you tried ChatGPT Agent?\n\nhashtag#chatgpt hashtag#ai hashtag#openai hashtag#technology hashtag#business hashtag#startup",
        "likes": 2834,
        "comments": 152,
        "reposts": 16,
        "line_count": 34,
        "purpose": "Share industry insights",
        "tags": [
            "Artificial Intelligence",
            "Technology"
        ]
    },
    {
        "text": "Today, I turned 24.\n\nAnd I think it’s a weird age.\nI’m not old enough to be wise.\n\nI’m also not young enough to be reckless.\n\nSome friends are getting married.\nSome are living abroad.\nSome are doing masters.\nWhile some are taking the biggest bet of their life by starting a company.\n\nBetween giving ted talks, travelling the world, hiring people, my life looks sorted on the outside.\nBut to be honest, I’m just as clueless about the future today as i was when i dropped out of college.\n\n3 years ago, came to bangalore with a dream.\n\nToday that dream is an office and a 20 person team.\n\nTo all of you working on yourself, getting fitter, upskilling, and figuring out life as it comes,\n\nThe best thing I've done is to believe in myself. There’s nothing more attractive than that.\n\nThis is part 1 of 24 lessons i learned at 24.\n\nFollow for the next 23!",
        "likes": 6139,
        "comments": 209,
        "reposts": 3,
        "line_count": 23,
        "purpose": "Share a personal story",
        "tags": [
            "Motivation",
            "Career Advice",
            "Self Improvement"
        ]
    },
    {
        "text": "Today, I turned 24.\n\nAnd I think it’s a weird age.\nI’m not old enough to be wise.\n\nI’m also not young enough to be reckless.\n\nSome friends are getting married.\nSome are living abroad.\nSome are doing masters.\nWhile some are taking the biggest bet of their life by starting a company.\n\nBetween giving ted talks, travelling the world, hiring people, my life looks sorted on the outside.\nBut to be honest, I’m just as clueless about the future today as i was when i dropped out of college.\n\n3 years ago, came to bangalore with a dream.\n\nToday that dream is an office and a 20 person team.\n\nTo all of you working on yourself, getting fitter, upskilling, and figuring out life as it comes,\n\nThe best thing I've done is to believe in myself. There’s nothing more attractive than that.\n\nThis is part 1 of 24 lessons i learned at 24.\n\nFollow for the next 23!",
        "likes": 6139,
        "comments": 209,
        "reposts": 3,
        "line_count": 24,
        "purpose": "Celebrate a milestone",
        "tags": [
            "Career Advice",
            "Self Improvement",
            "Entrepreneurship"
        ]
    },
    {
        "text": "Building with people is SUPER fun!🚀\n\nAnd I'm hiring for more...\n\nIt's been 8 months of us getting working from our Bangalore office and I never imagined it would go soo well.\n\nMe and Saransh have been running MarkitUp completely remotely since February 2021. Only recently we took the risk of getting an office and hiring full-time people. And I wouldn't go back to remote work.\n\nI enter the office and see everyone working on a new thumbnail, a new video, a new script and it makes me super proud.\n\n💡The team is expanding and I'm looking to hire YouTube Managers.\n\nThis is a full-time onsite role with a salary of around 10LPA.\n\nHere’s what you'll do:\n1. Client Communication: Be the primary point of contact, take briefs, give updates, and flag issues early.\n\n2. Team Coordination: Work closely with in-house and freelance editors, designers, and writers to execute deliverables.\n\n3. Creative Oversight: Review and provide feedback on video edits, scripts, thumbnails, and covers.\n\n4. Scriptwriting & Review: Occasionally write or refine scripts for reels, long-form videos, and brand deals.\n\n5. Content Strategy & Research: Bring fresh ideas, trends, and hooks to the table for multiple platforms.\n\n6. SEO + Metadata: Suggest titles, descriptions, hashtags, and optimise across YouTube, Instagram, LinkedIn.\n\n7. Publishing & QC: Handle final uploads, quality checks, and delivery including shorts, podcasts, newsletters, etc.\n\n👉If this sounds exciting, email saransh@markitup.in with:\n1. Your resume\n2. Experience (Atleast 2 yrs needed)\n3. Links of the content you've worked on\n4. By when would you be able to join?\n5. Contact Number\n\nSee you!",
        "likes": 2566,
        "comments": 117,
        "reposts": 9,
        "line_count": 24,
        "purpose": "Announce a job opening",
        "tags": [
            "Job Search",
            "Entertainment"
        ]
    },
    {
        "text": "The best decision I have made in my 20s is to MOVE.\n\nChange cities, countries, timezones and it is the easiest life upgrade.\n\nEvery time i move out of my home, \n\nMy income grows\nMy learning grows\nMy network expands\nMy character evolves\nMy confidence on another level\nI just start thinking bigger\n\nWhat do you think?\n\n#career hashtag#business hashtag#startup",
        "likes": 1495,
        "comments": 95,
        "reposts": 5,
        "line_count": 9,
        "purpose": "Share a personal story",
        "tags": [
            "Career Advice",
            "Business",
            "Entrepreneurship"
        ]
    },
    {
        "text": "I’m flying to USA again!🇺🇸\n\nFor Meta’s latest business event…\n\nConversations happening in Miami on 1st July.\n\nBusinesses use WhatsApp every day to deepen customer interaction and improve engagement.\n\nBut the latest features coming to WhatsApp’s Update tab are really interesting:\n\n1. Channel subscriptions: You can support your favorite channel by subscribing to receive exclusive content for a monthly fee.\n\n2. Promoted Channels: You can now discover new channels that might be interesting to you and for the first time, admins can boost their presence and grow their channel.\n\n3. Status Ads: Channels and businesses can now pay to appear in Status to unlock more conversations on WhatsApp about a product or service.\n\nI’m super excited to attend the event in miami to try out these features and see how businesses are using it to market themselves better.\n\nI remember downloading WhatsApp for the first time as a kid in 2014. Today, I’m getting to attend its event in-person.\n\nGrateful to Meta for this opportunity!🙏\n\nhashtag#meta hashtag#whatsapp hashtag#business hashtag#startup hashtag#marketing",
        "likes": 1836,
        "comments": 74,
        "reposts": 1,
        "line_count": 15,
        "purpose": "Share industry insights",
        "tags": [
            "Entrepreneurship",
            "Business",
            "Technology"
        ]
    },
    {
        "text": "My videos have 37 Crore views.📈\n\nAll because of this factor...\n\nEvery day 25 Lakh videos are uploaded on YouTube. But less than 10% of them get more than a 1000 views.\n\nIn a world where attention is scarce, getting noticed is everything. People get visual cues faster than titles and hence, the skill to create catchy thumbnails has quickly grown in demand. So much so that, graphic design now has a new niche called thumbnail designers.\n\nThese are graphic designers who understand the psychology of a user on youtube and knows how to use design to make them stop scrolling and grab attention.\n\nUsing the right colors, facial expressions, imagery, before/after and big bold text have all helped me create thumbnails that get over 9% CTR(click-through rate).\n\nCatchy thumbnails drive video clicks, which drives user retention which tells youtube to recommend this video to more people, hence driving up Impressions.\n\nI'm looking to urgently hire 2 full time thumbnail designers for my team and MarkitUp.\n\nIf you obsess over thumbnails and psychology and are willing to relocate to our bangalore office, I'm offering above market salaries and a bonus for your skill.\n\nApply now.\nLink is in the first comment.\n\nhashtag#youtube hashtag#graphicdesign hashtag#bangalore hashtag#startup hashtag#socialmedia",
        "likes": 2685,
        "comments": 99,
        "reposts": 5,
        "line_count": 17,
        "purpose": "Announce a job opening",
        "tags": [
            "Design",
            "Entertainment",
            "Entrepreneurship",
            "Location"
        ]
    },
    {
        "text": "The West built e-commerce. \n\nIndia just built the first AI-native shopping platform.\n\nNo search. No wishlist. No decision fatigue.\n\nI avoid ordering clothes online.\n\nI'm afraid the clothes might not fit me and then I won’t have anything to wear at the last minute. \n\nFinally, this Indian startup is solving online shopping for all.\n\nGlance AI creates unique style looks of you, you never even imagined, then lets you shop exactly what you see.\n\nIt is built on Google’s latest image generation model - Imagen and also uses Gemini for intelligence and personalisation. \n\nBehind Glance AI is a smart combination of three powerful systems:\n\n1. A Commerce Intelligence Engine trained on 20 years of global shopping data\n\n2. A GenAI Visual Model using diffusion and geometry simulation for hyper-realistic try-ons\n\n3. A Transaction Model that maps these looks directly to shoppable products\n\n500+ brands already onboarded\n\nAccessible across smartphones, lock screens, and smart TVs\n\nIt creates a great opportunity for businesses too. \n\nSmall brands have the chance to be relevantly placed and get discovered easily. \n\nYou can try the app with the link in the comments. \n\nhashtag#GlanceAI hashtag#GenAI hashtag#AIcommerce hashtag#ArtificialIntelligence hashtag#AI hashtag#India hashtag#OnlineShopping",
        "likes": 2161,
        "comments": 119,
        "reposts": 11,
        "line_count": 17,
        "purpose": "Announce a product/service",
        "tags": [
            "Artificial Intelligence"
        ]
    },
    {
        "text": "There are soo many creative talented 20 year olds in India who are stuck in the worst 4 year engineering degrees.\n\nMost of these engineering degrees have poor placements and low CTCs after the 4 years and $ spent.\n\nThese 20 year olds can easily get paid 40-60K per month as an editor, copywriter, designer in blr, bom, del\n\nThey will be better off quitting college and going all in.\n\nBut “papa nai maanege”.\n\nIts honestly unfortunate.\n\nhashtag#college hashtag#career hashtag#engineering",
        "likes": 3437,
        "comments": 181,
        "reposts": 11,
        "line_count": 7,
        "purpose": "Offer career advice",
        "tags": [
            "Engineering",
            "Career Advice",
            "Education"
        ]
    },
    {
        "text": "Fiverr & Upwork dont work for developers.\n\nBut this website does!🔥\n\nIn the age of AI, top tech companies are laying off and startups are freezing hiring. As a result, software engineers were hit the hardest in the last few years.\n\nBut working as a freelance developer remotely has been on the rise.\n\nI came across Outlier which is actively looking to work with real developers and offering $27/hr in India and uptown $50/hr for countries around the world.\n\nThey work with top ai companies to improve models to write and understand code.\n\nAs a developer, you will be:\n\n1. Reviewing AI generated HTML, CSS, and Javascript\n\n2. Give feedback on UI/UX and responsive design\n\n3. Write prompts to teach AI great frontend code practices\n\nAll you need to have is:\n\n1. English proficiency\n\n2. Solid skills in frontend technologies like react, vue, nextjs\n\n3. Experience with building polished, production ready websites.\n\nOnce you sign up for free and clear their short test, you’re ready to start earning in dollars from the comfort of your home.\n\nThere are people are like Daniel, MIT PhD student who has made $4000 by working for 100 hours on Outlier\n\nTry it out with the link in the first comment!\n\nhashtag#softwaredeveloper hashtag#programming hashtag#coding hashtag#remotework hashtag#career hashtag#freelancing hashtag#ai hashtag#softwareengineer",
        "likes": 1373,
        "comments": 36,
        "reposts": 5,
        "line_count": 24,
        "purpose": "Promote a product/service",
        "tags": [
            "Job Search",
            "Engineering"
        ]
    },
    {
        "text": "iPad can FINALLY replace your laptop!🤯\n\nAll thanks to the latest iPadOS 26...\n\nApple has long positioning iPad air/pro models as a replacement to a laptop for most users.\n\nFrom the 2016 \"what's a computer\" iPad Pro ad to the WWDC 25 last night.\n\nIt's finally happening!\n\n1. You can finally resize apps and multitask with overlapping windows\n\n2. The file management is soo much better allowing you to customize folders and drop a folder into the dock for quick access\n\n3. You get the close, minimize, fullscreen buttons like on the mac\n\n4. A preview app for all things PDF\n\n5. And menu bar options on any app you use with a new cursor\n\n6. You can export videos in the background while using any other app\n\n7. Chose audio source manually, record studio quality audio from airpods\n\nHonestly the biggest overhaul to the iPad since forever.\n\nWhat do you think?\n\nhashtag#technology hashtag#productivity hashtag#ipad hashtag#apple hashtag#tech hashtag#business",
        "likes": 743,
        "comments": 25,
        "reposts": 3,
        "line_count": 17,
        "purpose": "Share industry insights",
        "tags": [
            "Productivity",
            "Technology"
        ]
    },
    {
        "text": "Satya Nadella failed his Microsoft Interview.\n\nWHY? He couldn't answer THIS question...\n\nIn the 1990s, when Satya was interviewing to work at Microsoft as a developer, he passed every round there was. Solved every coding question with his problem solving skills optimizing time and data.\n\nBut then came the final HR round.\n\nThe question? What would you do if you see an infant baby crying in the middle of the road?\n\nHe said \"I'll run up to the phone booth and call 911\".\n\nThe recruiter ended the meeting and walked him out.\n\nSatya was shocked. Upon asking the recruiter, he said \"If you see a crying baby, the first thing you do is pick up and hug them before calling anyone. You need empathy\"\n\nEmpathy.\nSatya eventually got the job but this word stayed with him forever.\n\nInstilling empathy in everything he did at the company. Hearing everyone's POV and creating an inclusive culture. Asking deeper questions, taking feedback and making people feel seen.\n\nI was at the Microsoft office in Redmond recently and I could see it all around me. People being allowed to express themselves freely and collaborating on tasks. That's how they do the best work of their lives. I've learned this lesson as I work on building my team at MarkitUp. Since we're a content company full of creatives, we call it creative honesty.\n\nI love this quote I recently read:\n\nWe're not thinking machines that feel.\nWe are feeling machines that think.\n\nThoughts?\n\nhashtag#microsoft hashtag#leadership hashtag#business hashtag#startup hashtag#career hashtag#linkedin",
        "likes": 3083,
        "comments": 144,
        "reposts": 7,
        "line_count": 26,
        "purpose": "Share a personal story",
        "tags": [
            "Leadership",
            "Entrepreneurship",
            "Business",
            "Technology"
        ]
    },
    {
        "text": "Just shot an epic video at the OpenAI office in San Francisco.🤯\n\nI feel so fortunate getting all these opportunities!\n\nAll thanks to my obsession with making videos. At it for 5+ yrs now.\n\nSociety calls obsession \"toxic\", until it builds atomic bombs, electric grids or rockets. Then they call it genius.\n\nBe obsessed.\nBe limitless.\n\nhashtag#openai hashtag#business hashtag#startup hashtag#youtube hashtag#sanfrancisco",
        "likes": 5140,
        "comments": 94,
        "reposts": 4,
        "line_count": 6,
        "purpose": "Share a personal story",
        "tags": [
            "Entertainment",
            "Artificial Intelligence",
            "Business",
            "Entrepreneurship"
        ]
    },
    {
        "text": "I went to Google I/O 2025.🔥\n\nMy mind is officially blown away!\n\nHere are my 20 biggest takeaways:\n\n1. Veo 3\n2. Imagen 4\n3. Flow\n4. Lyria 2\n5. Agentic checkout\n6. Shopping try on feature\n7. Android XR Glasses\n8. Google Beam w/ HP\n9. Google Search AI Mode\n10. Gemini Agent Mode\n11. Project Mariner: teach and repeat, run 10 tasks together, on Gemini API\n12. Project Astra via Gemini Live\n13. Gemini 2.5 Flash & 2.5 Flash Lite & 2.5 Pro Deep Think\n14. SynthID\n15. Gemini text difussion\n16. Stitch\n17. Jules Coding Agent\n18. Gemini in Chrome, browsing assistant \n19. Google Meet Live Translation\n20. Google AI Pricing\n\nOne thing is clear, Google has slowly taken over the AI world with its latest suite of AI tools like:\nNotebookLM\nGoogle AI Studio\nFirebase Studio\nVertex AI\nAnd more!\n\nTheir tagline was Research to Reality. And they meant it.\n\nMost research papers never make it out. Google turned it into consumer apps that millions like me and you can use.\n\nWatch today's video to learn about the latest updates and use it to upskill and get more productive. Link is in the first comment!\n\nWhat a time to be alive!✨\n\nWhich launch did you like the most?\n\nhashtag#google hashtag#sanfrancisco hashtag#tech hashtag#business hashtag#ai hashtag#startup hashtag#productivity",
        "likes": 3634,
        "comments": 126,
        "reposts": 6,
        "line_count": 27,
        "purpose": "Share industry insights",
        "tags": [
            "Artificial Intelligence",
            "Business",
            "Technology"
        ]
    },
    {
        "text": "Theatres are charging you more.\n\nAnd people are happily paying!🤯\n\nI recently took my parents to watch a movie on PVR Luxe. I'd always heard of it but never tried it yet and was curious. The price per seat was 3x the regular ticket and FnB was easily 1.5–2x expensive.\n\nIs the reclining seat, gourmet food worth the price?\n\nApparently YES.\n\nInfact, these luxury theatres are driving a major chunk of the profit.\n\nIt costs them slightly more to build these luxury theatres but they make up for it in much higher spend per head.\n\nLet's assume you paid 900rs for a PVR Luxe seat, PVR keeps 225–270rs as its share. That's literally what a regular ticket costs.\n\nBut this is where it gets crazier. PVR makes its highest profit on FnB, upto 75%. So if you order food worth 500rs, PVR keeps 375rs as profit.\n\nThat's ~600rs in total profit per person.\n\nHence luxury theatre formats have been increasingly profitable for PVR.\n\nAnd rising middle class is willing to spend 2–3x more for an enhanced experience.\n\nHave you tried it?👀\n\nLet me know your thoughts below!\n\nhashtag#pvr hashtag#business hashtag#consumerism hashtag#movies hashtag#cinema",
        "likes": 2078,
        "comments": 62,
        "reposts": 0,
        "line_count": 17,
        "purpose": "Share industry insights",
        "tags": [
            "Entertainment",
            "Business"
        ]
    },
    {
        "text": "Super excited to be flying to San Francisco AGAIN!🤯\n\nShooting something really cool with OpenAI.\n\nI owe it all to content and your support. This is what makes me fly around the world and work with the biggest companies.\n\nWill be in SF 19–25th May.\n\nThis is my 6th trip to SF in less than a year but I always get fired up about San Francisco, it's a small city and within a 7 mile radius, you get to meet everyone from a Sam Altman to Elon Musk to the best AI companies and VCs.\n\nIt has the highest concentration of the smartest minds working on the world's biggest problems.\n\nUnlike New York, it's not about who you know or how much money you have. It's simply about building something useful and doing it at scale. All fame, recognition, money follows later.\n\nThis combined with greenery, the mountains, the beaches, the parks, the ocean scenes is something you won't get in any other city.\n\nExcited to be there again.\n\nStay tuned for the crazy upcoming videos :)\n\nhashtag#startup hashtag#business hashtag#sanfrancisco hashtag#openai hashtag#youtube",
        "likes": 2446,
        "comments": 66,
        "reposts": 0,
        "line_count": 13,
        "purpose": "Share a personal story",
        "tags": [
            "Artificial Intelligence",
            "Business",
            "Entrepreneurship",
            "Location"
        ]
    },
    {
        "text": "This is what you call customer delight!\n\nAnd most startups don’t get THIS...\n\nI recently ordered from Zomato and was surprised by the packaging and the copywriting.\n\nWe all think Khichdi is what you eat when you’re sick or when parents force you to have it.\n\nIt’s too boring!\n\nBut your Khichdi Brand doesn’t have to be! This cloud kitchen (Khichdi Bar) had an eye-catching dialogue appealing to the youth and their spin on the traditional Khichdi recipe.\n\nMaking a boring affair like having Khichdi feel fun, novel and cool again.\n\nThis is an excellent branding example for how to stand out in a crowded market. While costing the same as other competitors, they managed to get creative with the packaging.\n\nI really appreciate non-premium brands that go above and beyond to wow the users, be it Indigo with their clever copywriting inside their planes or Whole Truth Foods with their honest statements.\n\nThis also prompts customers to share the meal on social, increasing the word of mouth marketing.\n\nMost D2C brands focus on advertising their product without focussing first on reinventing their brand and how it looks. The unboxing experience has to wow the user, as Steve Jobs used to talk and obsess over.\n\nHave you noticed a similar example recently?\n\nLet me know below!\n\nhashtag#branding hashtag#marketing hashtag#business hashtag#startup hashtag#zomato",
        "likes": 1616,
        "comments": 80,
        "reposts": 6,
        "line_count": 17,
        "purpose": "Share industry insights",
        "tags": [
            "Marketing",
            "Business",
            "Entrepreneurship"
        ]
    },
    {
        "text": "Excel is used by 1.5 Billion workers!🤯\n\nYet only 6% know how to use it well. Why?...\n\n8 in 10 employees use spreadsheets at least once every day.\n\nSadly, 57% people report having no or only basic Excel skills. Many are unable to write basic Excel functions and formulas or create charts and tables to visualize data.\n\nThis is because of:\n- Lack of formal training\n- Complexity of most spreadsheet apps\n- Learning by trial and error leading to mistakes\n\nIf this relates to you, I found an EPIC AI tool that's quickly replacing traditional spreadsheets.\n\nQuadratic is a free AI tool that can create tables, write formulas, make charts,\nAll by just typing plain English!\n\nImagine being able to interact with your spreadsheet and watch it generate reports and insights in real time.\n\nYou can even switch to code view and edit the Python if you are a developer yourself. This way, you can customize your charts, tweak the formulas, and make it look exactly how you want.\n\nImporting data is super simple:\n• Upload any CSV file directly\n• Connect your database (PostgreSQL, MySQL)\n• Copy and paste from existing spreadsheets\n\nNo more struggling with complex formulas or wasting hours formatting charts. Just ask for what you need and watch it execute!🚀\n\nIt's perfect for students, business analysts, and working professionals.\n\nTry it for free with the link in my comments. Use code \"ISHANPRO\" to get a free month of their Pro Plan.\n\nhashtag#aitools hashtag#ai hashtag#productivity hashtag#spreadsheet hashtag#excel hashtag#artificialintelligence hashtag#business",
        "likes": 1036,
        "comments": 45,
        "reposts": 8,
        "line_count": 24,
        "purpose": "Announce a product/service",
        "tags": [
            "Productivity",
            "Artificial Intelligence"
        ]
    },
    {
        "text": "I'm hiring full time video editors at my marketing company!\n\n📍 Location: Bengaluru\n💰 Salary: ₹40K - ₹80K base per month + 1% profit share\n\n**Job Description:**\n- Editing reels, YouTube videos, teasers, etc.\n- Must be proficient with either Premiere Pro / Final Cut Pro / Da Vinci Resolve\n\n⚠️ *NOT FOR STUDENTS*\n\nApply ONLY if you live in Bengaluru or are willing to relocate to BLR.\n\nApply with the link below!👇\n\nhashtag#marketing hashtag#hiring hashtag#jobsearch hashtag#startup hashtag#bengaluru hashtag#business hashtag#videoeditor",
        "likes": 1197,
        "comments": 91,
        "reposts": 7,
        "line_count": 11,
        "purpose": "Announce a product/service",
        "tags": [
            "Job Search",
            "Marketing",
            "Entrepreneurship"
        ]
    },
    {
        "text": "International ho gayi he awaaz!🔥\n\nOn Singapore News TV for the first time.\n\nTalked about the controversial debate of AI stealing art from artists.\n\nIf anything, I think it enables artists to make art, better and faster.\n\nIf generalists like you and me can prompt ChatGPT to generate epic image styles like Studio Ghibli and build websites, imagine what the top 1% skilled people can do with detailed prompts!\n\nI think it's a 10x enabler. I already see really skilled designers and developers use it to ship faster.\n\nWhat are your thoughts?\n\nIt's just April and 2025 has already become the craziest year of my life!\n\nWhat about you?\n\nhashtag#ai hashtag#business hashtag#chatgpt hashtag#technology hashtag#artificialintelligence hashtag#art hashtag#media",
        "likes": 834,
        "comments": 58,
        "reposts": 4,
        "line_count": 11,
        "purpose": "Share industry insights",
        "tags": [
            "Artificial Intelligence",
            "Business",
            "Technology"
        ]
    },
    {
        "text": "Create a landing page and win a MacBook Pro M4.\n\nThis is HUGE!🔥\n\nJust turn a screenshot into a pixel perfect Frontend + add a NEW feature and deploy it.\n\nSubmit its public link along with its GitHub Repo.\n\nWinners get\n- MacBook Pro M4\n- PlayStation 5\n- RayBan Meta Glasses\n\nAnd the top 1% developers get a chance to work part time and earn up to $27 per hour.\n\nDeadline is Sunday 20th April EOD.\n\nMore details and application form in the comment below!\n\nhashtag#developer hashtag#softwareengineer hashtag#coding hashtag#tech hashtag#javascript hashtag#webdevelopment",
        "likes": 2014,
        "comments": 65,
        "reposts": 9,
        "line_count": 11,
        "purpose": "Promote an event/webinar",
        "tags": [
            "Engineering",
            "Technology"
        ]
    },
    {
        "text": "Meeting Javed Akhtar & AR Rahman was unreal! Absolute legends.🙏\n\nThanks to Apple for organising the MAMI Select and bringing everyone together under one roof to celebrate film making and storytelling.\n\nThis day has been nothing but dreamy for me.✨\n\nI shot a podcast with Amrita Bagchi & Chanakya Vyas, makers of the short films Tinctoria and Mangya.\n\nThey shared everything they've learned about storytelling, videography, sound design, editing and more. Had a gem of a conversation with them. Coming out soon.\n\nhashtag#ShotOniPhone",
        "likes": 2755,
        "comments": 49,
        "reposts": 1,
        "line_count": 5,
        "purpose": "Share a personal story",
        "tags": [
            "Entertainment",
            "Technology"
        ]
    },
    {
        "text": "Just gave a talk at IIT Delhi!🔥\n\n18 year old Ishan who failed JEE Advanced would be proud today.\n\n5 years. That's all it took.\n\nTalked about using AI tools to \n\n- automate sales\n- marketing\n- content\n- market research\n\nand build apps fast.\n\ncan't wait for you to see it\n\nGrateful🙏\n\nhashtag#iit hashtag#tedx hashtag#ai hashtag#business hashtag#startup",
        "likes": 4317,
        "comments": 148,
        "reposts": 8,
        "line_count": 11,
        "purpose": "Share a personal story",
        "tags": [
            "Artificial Intelligence",
            "Education",
            "Business"
        ]
    }
]